Revit 2026 API

# StringParameterValueValue Property

---

The stored value

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Value { get; set; }
```
```vb
Public Property Value As String
	Get
	Set
```
```cpp
public:
property String^ Value {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Value : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

StringParameterValue Class

Autodesk.Revit.DB Namespace